app/views/shared/_stats.html.erb

SELECT COUNT(*) FROM "rides" WHERE "rides"."user_id" = ?  [["user_id", 102]]
---
    <strong id="ownRides" class="stat">
      <%= @user.rides.count %>

SELECT COUNT(*) FROM "messages" WHERE "messages"."user_id" = ? AND "messages"."seen" = 'f'  [["user_id", 1]]
---
    <strong id="messages" class="stat">
      <%= @user.messages.where(:seen => false).count %>