app/controllers/hitchhikes_controller.rb

  def create
    @user = User.find(params[:hitchhike][:user_id])
    @ride = Ride.find(params[:hitchhike][:ride_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "6"]]

  def destroy
    @user = Hitchhike.find(params[:id]).user
    @ride = Hitchhike.find(params[:id]).ride
---
SELECT "hitchhikes".* FROM "hitchhikes" WHERE "hitchhikes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? ORDER BY "rides"."id" ASC LIMIT 1  [["id", 6]]