app/controllers/messages_controller.rb

  def update
    @message = Message.find(params[:id])
    @message.update_attribute(:seen, true)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "18"]]
UPDATE "messages" SET "seen" = ?, "updated_at" = ? WHERE "messages"."id" = 18  [["seen", true], ["updated_at", Sun, 01 Sep 2013 00:15:37 UTC +00:00]]

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "18"]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 18]]