app/controllers/rides_controller.rb

INSERT INTO "rides" ("addressto", "comment", "created_at", "destlatitude", "destlongitude", "latitude", "longitude", "scheduledfor", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ride = current_user.rides.build(ride_params)
    if @ride.save

DELETE FROM "rides" WHERE "rides"."id" = ?  [["id", 2]]
---
  def destroy
    @ride.destroy

SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]
---
  def edit
    @ride = Ride.find(params[:id])

SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "3"]]
UPDATE "rides" SET "addressto" = ?, "destlatitude" = ?, "destlongitude" = ?, "updated_at" = ? WHERE "rides"."id" = 3  [["addressto", "hamalacha, holon"], ["destlatitude", 32.015714], ["destlongitude", 34.800357], ["updated_at", Thu, 29 Aug 2013 14:28:13 UTC +00:00]]
---
  def update
    @ride = Ride.find(params[:id])
    if @ride.update_attributes(ride_params)