app/controllers/users_controller.rb

  def create
    if signed_in?
      redirect_to root_path, notice: "You are already a member."
    else
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("age", "created_at", "email", "gender", "name", "password_digest", "remember_token", "updated_at", "vehicle_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def myRides
    @title = "Own Rides"
    @user = User.find(params[:id])
    @rides = @user.rides.order("created_at DESC").paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "rides".* FROM "rides" WHERE "rides"."user_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "rides" WHERE "rides"."user_id" = ?  [["user_id", 1]]

  def my_messages
    @title = "My Messages"
    @user = User.find(params[:id])
    @messages = @user.messages.order("created_at DESC").paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ? ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 1]]

  def join_rides
    @title = "Join Rides"
    @user = User.find(params[:id])

    ride_ids = "SELECT ride_id FROM hitchhikes
                WHERE user_id = :user_id"
    @rides = Ride.where("id in (#{ride_ids})", user_id: @user.id).paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "rides".* FROM "rides" WHERE (id in (SELECT ride_id FROM hitchhikes
SELECT COUNT(*) FROM "rides" WHERE (ride_id in (SELECT ride_id FROM hitchhikes