app/views/hitchhikes/destroy.js.erb

$("#join_ride_form<%= @ride.id %>").html("<%= escape_javascript(render('rides/join_ride', :locals => {:ride => @ride})) %>")
$("#joinRides").html('<%= @user.hitchhikes.count %>')
---
SELECT "hitchhikes".* FROM "hitchhikes" WHERE "hitchhikes"."ride_id" = ? AND "hitchhikes"."user_id" = 4 LIMIT 1  [["ride_id", 6]]