app/views/rides/_unjoin_ride.html.erb

<% ride ||= @ride %>
<%= form_for(ride.hitchhikes.find_by(user_id: @user),
             html: { method: :delete },
             remote: true) do |f| %>
---
SELECT "hitchhikes".* FROM "hitchhikes" WHERE "hitchhikes"."ride_id" = ? AND "hitchhikes"."user_id" = 4 LIMIT 1  [["ride_id", 6]]